[
  {
    "@context": "http://schema.org",
    "@type": "JobPosting",
    "datePosted": "2025-09-13T10:30:39.000Z",
    "description": "Job Requisition ID: 171358 Established in the 1930s as a trading business, Al-Futtaim Group today is one of the most diversified and progressive, privately held regional businesses headquartered in Dubai, United Arab Emirates. Structured into five operating divisions; automotive, financial services, real estate, retail and healthcare; employing more than 35,000 employees across more than 20 countries in the Middle East, Asia and Africa, Al-Futtaim Group partners with over 200 of the world's most admired and innovative brands. Al-Futtaim Group’s entrepreneurship and relentless customer focus enables the organization to continue to grow and expand; responding to the changing needs of our customers within the societies in which we operate. By upholding our values of respect, excellence, collaboration and integrity; Al-Futtaim Group continues to enrich the lives and aspirations of our customers each and every day Overview of the role: To establish rapport and credibility in assisting customers to purchase the company’s product range whilst at the same time maintaining the company’s standard of merchandising and ensuring stock availability to achieve sales target set by the company by going the extra mile to exceed expectations. What you will do: Deliver excellent customer service by engaging with customers, understanding their needs, and building trust. Monitor stock levels in your area and coordinate with Procurement and Shopkeeper to keep shelves stocked. Gather customer feedback regularly and act on it to improve their experience. Prepare pro forma invoices and follow up on quotations to help close sales. Identify sales opportunities, suggest add-ons, and report slow-moving items with improvement ideas. Maintain attractive merchandising according to company standards. Be knowledgeable about the full product range and stay updated on new items and market trends. Keep Sales Manager informed of customer feedback and product-related issues. What you will need: Experience in similar role or fresh graduates. Very good communication skills Positive attitude and customer focus About Al-Futtaim Retail Al-Futtaim Retail has established itself as one of the leaders in Retail across the Middle East, Africa & Asia over the past 30 years. We have developed partnerships with some of the biggest and most respected Brands in the world including IKEA, ACE and Toys R Us in the Middle East and the Inditex Group of Brands (Zara, Mango, Bershka and P&B) across Asia. We are also one of the largest Global partners of Marks and Spencer’s in both regions with over 75 stores offering both fashion & food options. Most recently we have been responsible for bringing brands to the Middle East for the first time with the exciting launches of Watsons and B&Q and we aim to continue to be agile and adaptive to our markets with new launches and further development. For this to be possible we aim to recruit the best talent from all backgrounds who will continue to challenge and develop our diverse workforce which includes over 100 nationalities across 12 countries. Join us today and make a difference… About Al-Futtaim IKEA GROWING TOGETHER... We are a values-driven company with a passion for life at home. Our vision is to create a better everyday life for the many people. Al-Futtaim IKEA holds the franchise rights for IKEA in Egypt, Oman, Qatar and the United Arab Emirates.",
    "employmentType": "FULL_TIME",
    "hiringOrganization": {
      "@type": "Organization",
      "name": "Al-Futtaim",
      "sameAs": "https://ae.linkedin.com/company/alfuttaim",
      "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQG-Yvdc8YircA/company-logo_200_200/B4DZjQL59IG8AI-/0/1755839439777/alfuttaim_logo?e=2147483647&amp;v=beta&amp;t=79DMuzHt1LtQzaSkk36MfJe2JYPf2BNBLATL4zmf9eI"
    },
    "identifier": {
      "@type": "PropertyValue",
      "name": "Al-Futtaim",
      "value": "171358-en_GB"
    },
    "image": "https://media.licdn.com/dms/image/v2/D4D0BAQG-Yvdc8YircA/company-logo_100_100/B4DZjQL59IG8AQ-/0/1755839439777/alfuttaim_logo?e=2147483647&amp;v=beta&amp;t=Flx1uA7Ad_Nf21ti1yX8rFtBM5Hw1mxiWQ6bzgPOeP4",
    "industry": "Retail",
    "jobLocation": {
      "@type": "Place",
      "address": {
        "@type": "PostalAddress",
        "addressCountry": "EG",
        "addressLocality": "Cairo",
        "addressRegion": null,
        "streetAddress": null
      },
      "latitude": 30.043488,
      "longitude": 31.235292
    },
    "skills": "",
    "title": "Sales Assistant | IKEA | Mall of Arabia EGYPT",
    "validThrough": "2025-10-21T19:09:00.000Z",
    "educationRequirements": {
      "@type": "EducationalOccupationalCredential",
      "credentialCategory": "high school"
    },
    "job_link": "https://eg.linkedin.com/jobs/view/sales-assistant-ikea-mall-of-arabia-egypt-at-al-futtaim-4289960106"
  },
  {
    "@context": "http://schema.org",
    "@type": "JobPosting",
    "datePosted": "2025-09-13T11:21:43.000Z",
    "description": "About Us A career at Hitachi Rail will help create a legacy. With operations in every corner of the world, our work goes to the cutting-edge of digital transformation and technology. From the multi-cultural strength of our global organisation to the sustainable and innovative ways we work to bring people together, there's something for everyone to get stuck into. And that's where you come in. Cairo, Egypt (On-Site) Job Description: Review station coordination drawings to ensure compliance with AFC system requirements. Oversee the installation, testing, and commissioning of AFC equipment on-site. Ensure the application of Health, Safety, and Environmental (HSE) rules on-site. Coordinate with other contractors on-site to resolve issues. Record technical information and prepare installation and electrical testing reports. Conduct official AFC system tests with the client and prepare corresponding reports. Job Requirements: Bachelor's degree in communications & Electronics or Power Engineering. 1 to 5 years of relevant experience. Proven experience in electrical installation and troubleshooting. Demonstrated ability to write technical documents. Proficiency in AutoCAD and Revit. Strong skills in using Windows and MS Office. Experience with network installation and configuration. Excellent communication, interpersonal, and leadership skills. Proficiency in written and spoken English. Thank you for your interest in Hitachi Rail. If your application is of interest, we will be in contact. Please do not hesitate to discover more about us and our latest jobs at https://www.hitachirail.com/careers . At Hitachi Rail, there is a place for everyone. We welcome and value differences in background, age, gender, sexuality, family status, disability, race, nationality, ethnicity, religion, and world view. It is our commitment to create an inclusive environment - we are proud to be an equal opportunity employer. We would be delighted if you would be one of our followers at https://www.linkedin.com/company/hitachirail .",
    "employmentType": "FULL_TIME",
    "hiringOrganization": {
      "@type": "Organization",
      "name": "Hitachi Rail",
      "sameAs": "https://uk.linkedin.com/company/hitachirail",
      "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQHsgde5W_AcpQ/company-logo_200_200/B4EZXt_8PPGwAU-/0/1743454717965/hitachirail_logo?e=2147483647&amp;v=beta&amp;t=448F9RX2vBJgIHI4BZxBsPenMwQtMPcchBMywffWmjU"
    },
    "identifier": {
      "@type": "PropertyValue",
      "name": "Hitachi Rail",
      "value": "15477667"
    },
    "image": "https://media.licdn.com/dms/image/v2/D4E0BAQHsgde5W_AcpQ/company-logo_100_100/B4EZXt_8PPGwAc-/0/1743454717965/hitachirail_logo?e=2147483647&amp;v=beta&amp;t=zuTZ6VEMsSY2-bfqXBzc5kRdo0l_WF-FMzZlobKc_tc",
    "industry": "Rail Transportation",
    "jobLocation": {
      "@type": "Place",
      "address": {
        "@type": "PostalAddress",
        "addressCountry": "EG",
        "addressLocality": "New Cairo",
        "addressRegion": null,
        "streetAddress": null
      },
      "latitude": 30.00123,
      "longitude": 31.432434
    },
    "skills": "",
    "title": "Installation Engineer",
    "validThrough": "2026-01-15T12:54:48.000Z",
    "educationRequirements": {
      "@type": "EducationalOccupationalCredential",
      "credentialCategory": "bachelor degree"
    },
    "experienceRequirements": {
      "@type": "OccupationalExperienceRequirements",
      "monthsOfExperience": 12
    },
    "job_link": "https://eg.linkedin.com/jobs/view/installation-engineer-at-hitachi-rail-4129174868"
  },
  {
    "@context": "http://schema.org",
    "@type": "JobPosting",
    "datePosted": "2025-09-12T23:50:32.000Z",
    "description": "Additional Information Job Number 25067989 Job Category Finance & Accounting Location JW Marriott Residences New Cairo Al Jazi First, 42 El Hegaz Street Mohandessin, Giza, Cairo, Egypt, Egypt,VIEW ON MAP Schedule Full Time Located Remotely? N Position Type Management Job Summary Manages the day-to-day operation of the accounting office and assists the property Director of Finance and Accounting in providing financial leadership to the business. Primary responsibilities include financial analysis and financial reporting, budgeting/forecasting, audit and control, asset and liability reconciliation, working capital and cash control. Assists with capital expenditure plans (Return On Investment Analysis), owner relations and owner reporting. CANDIDATE PROFILE Education And Experience 4-year bachelor's degree in Finance and Accounting or related major; no work experience required. CORE WORK ACTIVITIES Leading Accounting Team Utilizes interpersonal and communication skills to lead, influence, and encourage others; advocates sound financial/business decision-making; demonstrates honesty/integrity; leads by example. Celebrates successes and publicly recognizes the contributions of team members. Establishes and maintains open, collaborative relationships with employees and ensures employees do the same within the team. Leverages strong functional leadership and communication skills to influence the management team and to lead own team. Creates a working environment that enables the retention of top talent and where individuals perform at their best. Encourages open dialogue between team members. Assigns team members and other department managers clear accountability to accomplish goals. Ensures disciplinary procedures and documentation are completed according to Standard and Local Operating Procedures (SOPs and LSOPs) and support the Peer Review Process. Uses all available on the job training tools for employees. Ensures property policies are administered fairly and consistently. Maintaining Finance and Accounting Goals Submits reports in a timely manner, ensuring delivery deadlines. Ensures profits and losses are documented accurately. Achieves and exceeds goals including performance goals, budget goals, team goals, etc. Develops specific goals and plans to prioritize, organize, and accomplish your work. Monitors all taxes that apply, ensuring that taxes are current, collected and/or accrued. Compiles, codes, categorizes, calculates, tabulates, audits, or verifies information or data. Maintains a strong accounting & operational control environment to safeguard assets, improve operations and profitability and manage business risks. Generates and reviews financial reports that are linked to the plan’s financial goals. Managing Projects and Policies Generates and provides accurate and timely results in the form of reports, presentations, etc. Analyzes information and evaluating results to choose the best solution and solve problems. Ensures that the P&L is accurate (i.e., costs are properly matched to revenue, costs are recorded in the proper accounts) and statements are delivered to appropriate individuals in a timely manner. Reconciles balance sheet and ensures account balances are supported by appropriate documentation in accordance with SOPs. Oversees internal, external and regulatory audit processes and ensures compliance with Standard Operating Procedures (SOPs). Produces accurate and timely financial reports to support effective decision-making. Ensures compliance with standard and local operating procedures (SOPs and LSOPs). Ensures tax rates used for sales/use tax are current and proper amounts are collected and/or accrued. Documents tax exempt transactions. Demonstrating and Applying Accounting Knowledge Demonstrates knowledge of job-relevant issues, products, systems, and processes. Uses computers and computer systems (including hardware and software) to program, write software, set up functions, enter data, or process information. Uses relevant information and individual judgment to determine whether events or processes comply with laws, regulations, or standards. Keeps up-to-date technically and applying new knowledge to your job. Provides analytical support during budget reviews to identify cost saving and productivity opportunities. Proving Financial Information And Guidance To Others Informs and/or updates the executives, the peers and the subordinates on relevant information in a timely manner. Provides on going analytical support (e.g., monitoring the operating department’s actual and projected sales and profit and coaches management team to ensure financial goals are met and opportunities are identified and addressed). Orients property managers to the accounting function and coaches to effectively manage their department’s financial performance. Provides meaning or context to the financial results. Advises the Director of Finance on existing and evolving operating/financial issues. Provide direction and assistance to other organizational units regarding accounting and budgeting policies and procedures, and efficient control and utilization of financial resources. Managing and Conducting Human Resource Activities Ensures team members are cross-trained to support successful daily operations. Ensures property policies are administered fairly and consistently. Ensures new hires participate in the department’s orientation program. Ensures new hires receive the appropriate new hire training to successfully perform their job. Creates appropriate development plans which develop team members based on their individual strengths, development needs, career aspirations and abilities. Additional Responsibilities Provides information to supervisors, co-workers, and subordinates by telephone, in written form, e-mail, or in person. Communicates financial concepts in a clear and persuasive manner that is easy to understand and drives desired behaviors. Attends critique meetings to review information with management team. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. Marriott Hotels strive to elevate the art of hospitality, innovating at every opportunity while keeping the comfort of the oh-so-familiar all around the globe. As a host with Marriott Hotels, you will help keep the promise of “Wonderful Hospitality. Always.” by delivering thoughtful, heartfelt, forward-thinking service that upholds and builds upon this living legacy. With the name that’s synonymous with hospitality the world over, we are proud to welcome you to explore a career with Marriott Hotels. In joining Marriott Hotels, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you. JW Marriott is part of Marriott International's luxury portfolio and consists of more than 100 beautiful properties in gateway cities and distinctive resort locations around the world. JW believes our associates come first. Because if you’re happy, our guests will be happy. JW Marriott associates are confident, innovative, genuine, intuitive, and carry on the legacy of the brand’s namesake and company founder, J.Willard Marriott. Our hotels offer a work experience unlike any other, where you’ll be part of a community and enjoy true camaraderie with a diverse group of co-workers. JW creates opportunities for training, development, recognition and most importantly, a place where you can pursue your passions in a luxury environment with a focus on holistic well-being. Treating guests exceptionally starts with the way we take care of our associates. That’s The JW Treatment™. In joining JW Marriott, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.",
    "employmentType": "FULL_TIME",
    "hiringOrganization": {
      "@type": "Organization",
      "name": "Marriott International",
      "sameAs": "https://www.linkedin.com/company/marriott-international",
      "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQGY9JOK2_SC_w/company-logo_200_200/company-logo_200_200/0/1631331720398?e=2147483647&amp;v=beta&amp;t=vHvHSShBDMFxNqriqI5u6pSorWYbgnmncZHjBGqRPaY"
    },
    "identifier": {
      "@type": "PropertyValue",
      "name": "Marriott International",
      "value": "25067989-en"
    },
    "image": "https://media.licdn.com/dms/image/v2/C4E0BAQGY9JOK2_SC_w/company-logo_100_100/company-logo_100_100/0/1631331720398?e=2147483647&amp;v=beta&amp;t=GVJzRaSP4n_a7WLCdKQyARJep-53ILmUnAN0Jbdya54",
    "industry": "Hospitality",
    "jobLocation": {
      "@type": "Place",
      "address": {
        "@type": "PostalAddress",
        "addressCountry": "EG",
        "addressLocality": "Cairo",
        "addressRegion": null,
        "streetAddress": null
      },
      "latitude": 30.043488,
      "longitude": 31.235292
    },
    "skills": "",
    "title": "Financial Controller",
    "validThrough": "2025-10-12T23:50:32.000Z",
    "educationRequirements": {
      "@type": "EducationalOccupationalCredential",
      "credentialCategory": "bachelor degree"
    },
    "job_link": "https://eg.linkedin.com/jobs/view/financial-controller-at-marriott-international-4299647949"
  },
  {
    "@context": "http://schema.org",
    "@type": "JobPosting",
    "datePosted": "2025-09-12T20:01:25.000Z",
    "description": "Job Requisition ID: 171790 Established in the 1930s as a trading business, Al-Futtaim Group today is one of the most diversified and progressive, privately held regional businesses headquartered in Dubai, United Arab Emirates. Structured into five operating divisions; automotive, financial services, real estate, retail and healthcare; employing more than 35,000 employees across more than 20 countries in the Middle East, Asia and Africa, Al-Futtaim Group partners with over 200 of the world's most admired and innovative brands. Al-Futtaim Group’s entrepreneurship and relentless customer focus enables the organization to continue to grow and expand; responding to the changing needs of our customers within the societies in which we operate. By upholding our values of respect, excellence, collaboration and integrity; Al-Futtaim Group continues to enrich the lives and aspirations of our customers each and every day نظرة عامة على الدور الإشراف وتقديم الدعم في مكتب المعلومات لمساعدة العملاء بطريقة ودودة ومهنية. Overview Of The Role To oversee and provide support at the Information Desk, assisting customers in a friendly and professional manner. ما ستفعله الترحيب بالعملاء واستقبالهم عند وصولهم إلى المتجر. الرد على استفسارات العملاء وتقديم الإرشادات حول التسوق في إيكيا. التعامل مع الشكاوى الروتينية بسرعة وبأدب. تسجيل ملاحظات العملاء في نظام إدارة علاقات العملاء لبناء قاعدة بيانات للحلول المتكررة. ضمان معاملة العملاء باحترافية لتحقيق أقصى درجات الرضا. القيام بالإعلانات ونداء الأشخاص المطلوبين من قبل الزوار. حفظ أمتعة العملاء وتأمينها. توفير أدوات التسوق والكتالوجات للعملاء. تقديم الأكياس / العربات حسب الحاجة. الالتزام بالإجراءات والسياسات النظامية. تقديم اقتراحات تحسين مستمرة إلى مشرف العملاء. التواصل مع مدير المناوبة في حال وجود شكاوى تتطلب تدخل الإدارة. What You Will Do Greet and welcome customers upon arrival at the store. Answer customer inquiries and guide them on how to shop at IKEA. Handle routine customer complaints promptly and courteously. Log customer feedback into the CRM system to build a knowledge base of frequent inquiries and solutions. Ensure professional treatment of customers to maximize satisfaction. Make announcements and page requested visitors. Safely store customers’ bags and ensure security. Ensure availability of shopping tools and catalogues. Provide bags and trolleys as appropriate. Adhere to system policies and procedures. Provide continuous improvement suggestions to the Customer Senior. Communicate with the Duty Manager regarding complaints requiring management assistance. ما ستحتاجه خبرة لا تقل عن سنتين في خدمة العملاء أو استقبال. What You Will Need Minimum 2 years of experience in Customer Service or Reception. About Al-Futtaim Retail Al-Futtaim Retail has established itself as one of the leaders in Retail across the Middle East, Africa & Asia over the past 30 years. We have developed partnerships with some of the biggest and most respected Brands in the world including IKEA, ACE and Toys R Us in the Middle East and the Inditex Group of Brands (Zara, Mango, Bershka and P&B) across Asia. We are also one of the largest Global partners of Marks and Spencer’s in both regions with over 75 stores offering both fashion & food options. Most recently we have been responsible for bringing brands to the Middle East for the first time with the exciting launches of Watsons and B&Q and we aim to continue to be agile and adaptive to our markets with new launches and further development. For this to be possible we aim to recruit the best talent from all backgrounds who will continue to challenge and develop our diverse workforce which includes over 100 nationalities across 12 countries. Join us today and make a difference… About Al-Futtaim IKEA GROWING TOGETHER... We are a values-driven company with a passion for life at home. Our vision is to create a better everyday life for the many people. Al-Futtaim IKEA holds the franchise rights for IKEA in Egypt, Oman, Qatar and the United Arab Emirates.",
    "employmentType": "FULL_TIME",
    "hiringOrganization": {
      "@type": "Organization",
      "name": "Al-Futtaim",
      "sameAs": "https://ae.linkedin.com/company/alfuttaim",
      "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQG-Yvdc8YircA/company-logo_200_200/B4DZjQL59IG8AI-/0/1755839439777/alfuttaim_logo?e=2147483647&amp;v=beta&amp;t=79DMuzHt1LtQzaSkk36MfJe2JYPf2BNBLATL4zmf9eI"
    },
    "identifier": {
      "@type": "PropertyValue",
      "name": "Al-Futtaim",
      "value": "171790-en_GB"
    },
    "image": "https://media.licdn.com/dms/image/v2/D4D0BAQG-Yvdc8YircA/company-logo_100_100/B4DZjQL59IG8AQ-/0/1755839439777/alfuttaim_logo?e=2147483647&amp;v=beta&amp;t=Flx1uA7Ad_Nf21ti1yX8rFtBM5Hw1mxiWQ6bzgPOeP4",
    "industry": "Retail",
    "jobLocation": {
      "@type": "Place",
      "address": {
        "@type": "PostalAddress",
        "addressCountry": "EG",
        "addressLocality": "Cairo",
        "addressRegion": null,
        "streetAddress": null
      },
      "latitude": 30.043488,
      "longitude": 31.235292
    },
    "skills": "",
    "title": "Shopping Experience Assistant | IKEA | CFC",
    "validThrough": "2025-10-12T20:01:25.000Z",
    "educationRequirements": {
      "@type": "EducationalOccupationalCredential",
      "credentialCategory": "high school"
    },
    "experienceRequirements": {
      "@type": "OccupationalExperienceRequirements",
      "monthsOfExperience": 24
    },
    "job_link": "https://eg.linkedin.com/jobs/view/shopping-experience-assistant-ikea-cfc-at-al-futtaim-4299797798"
  },
  {
    "@context": "http://schema.org",
    "@type": "JobPosting",
    "datePosted": "2025-09-13T10:46:58.000Z",
    "description": "Join us and celebrate the beauty of human experience. Create for happier, healthier lives, with love for nature. Together, with passion and creativity, we deliver food innovations, craft inspired fragrances and develop beauty and wellbeing solutions. There’s much to learn and many to learn from, with more than 16,000 employees around the world to explore ideas and ambitions with. Every day, your talent, your innovative spirit, and your determination will shape our future, making a positive difference on billions of people. Every essence of you enriches our world. We are Givaudan. Human by nature. We have now opened up a new 'Flavourist' position to be based in our 6th October City office near Cairo in Egypt . This exciting role is a permanent and long-term role, and will focus on our Flavours business in Egypt. You will report into the Egypt Technical Manager based in Egypt. You will be part of an exclusive global team of very experienced Flavourists in Givaudan and in a position to further develop your knowledge together with your colleagues within and outside your own team and region. Purpose Manage flavour development projects, to ensure effective and successful creation process in cooperation with customers, according to our goals and EH&S policies. Main Responsibilities: Flavour Preparation & Evaluation: Prepare flavour samples as requested for customer briefs, applications needs, technology performance assessment, QC standards, physical testing. Create new flavour creations or modify existing flavours to meet customer requirements, internal testing needs, or new technology development for multiple flavour types Help evaluate materials developed internally or from external sources and assess potential for flavour creation Accomplish daily tasks and manage assigned projects and provide flavours which meet all defined project needs, considering when relevant good manufacturing practices, sample scale-up, production requirements, regulatory compliance Knowledge Sharing & Expertise: When requested serve as technical expert to resolve flavour production issues and customer complaints and complete ownership of created flavours Coach, train, motivate, and mentor flavour assistants Participate and learn about all departments (analytical chemistry, sensory, consumer understanding, regulatory, flavour de-livery, manufacturing) Be a technical expert and advisor to internal and external partners and customers for ingredient and flavour performance for multiple flavour types Contribute to discussions of research plans, sensory results/insights, making experimental observations and making connections to related, but separate technologies Make suggestions for future research or sensory activities Contribute to the planning of technical or sensory projects Environmental Health & Safety Maintain a safe, clean and organized lab environment following EH&S policies and hold others accountable for following these guidelines Academic Background Bachelor's Degree in Food Science, Chemistry, Biology or similar Professional Experience Minimum of 5 years of experience as a Flavourist AFTER completion of Givaudan Flavourist Trainee Programme or accepted industry equivalent Technical Skills Expert level tasting skills with an intermediate level ability to understand how to adjust a flavour formulation in the direction needed for flavour modifications Intermediate level knowledge of raw materials and flavour ingredients with an expert level ability to create selected flavour types to deliver flavour performance for customer briefs, research and development needs Intermediate level understanding of common Givaudan flavour creation solvent and carrier systems Intermediate level ability to interface with customers and discuss the flavour creation needs for selected flavour types and provide direction to help solve flavour performance issues in their applications Intermediate level knowledge of local and regional regulatory requirements for flavours Ability to present complex flavour creation related technical presentations Intermediate level knowledge of application equipment, ingredients, and manufacturing procedures Intermediate level knowledge of formulating suitable delivery systems for several application bases Intermediate level knowledge of analytical methodologies (G.C. HPLC, Mass Spec.) Expert level knowledge of flavour manufacturing equipment and processes Intermediate level knowledge of flavour performance and be able to produce using this data to improve flavour performance Manage flavour assistants Our Benefits: Great compensation package Medical Insurance (includes family) Life insurance Pension Plan Shuttle Bus Annual Bonus Multiple location: Cairo (Egypt), Dubai (United Arab Emirates) At Givaudan, you contribute to delightful taste and scent experiences that touch people’s lives. You work within an inspiring teamwork culture – where you can thrive, collaborate and learn from other talented and passionate people across disciplines, regions and divisions. Every essence of you enriches our world. Diversity drives innovation and creates closer connections with our employees, customers and partners. Givaudan embraces diversity and is committed to building an inclusive environment where everyone impacts our world.",
    "employmentType": "FULL_TIME",
    "hiringOrganization": {
      "@type": "Organization",
      "name": "Givaudan",
      "sameAs": "https://ch.linkedin.com/company/givaudan",
      "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQE6qP4TReFuKA/company-logo_200_200/B4DZaAwXlNG4AI-/0/1745916886418/givaudan_logo?e=2147483647&amp;v=beta&amp;t=kKMaSMkXk4Vq8cG4J4XP7fIXl_kbnm3YHIyVqdXYFKk"
    },
    "identifier": {
      "@type": "PropertyValue",
      "name": "Givaudan",
      "value": "1200698501"
    },
    "image": "https://media.licdn.com/dms/image/v2/D4D0BAQE6qP4TReFuKA/company-logo_100_100/B4DZaAwXlNG4AQ-/0/1745916886418/givaudan_logo?e=2147483647&amp;v=beta&amp;t=XkJHfDYCClX4UKpLYAJY8vsRjsZYZyU7PiJMTMZrd_A",
    "industry": "Chemical Manufacturing",
    "jobLocation": {
      "@type": "Place",
      "address": {
        "@type": "PostalAddress",
        "addressCountry": "EG",
        "addressLocality": "Cairo",
        "addressRegion": null,
        "streetAddress": null
      },
      "latitude": 30.043488,
      "longitude": 31.235292
    },
    "skills": "",
    "title": "Flavourist Sweet- Egypt",
    "validThrough": "2025-12-03T11:55:34.000Z",
    "educationRequirements": {
      "@type": "EducationalOccupationalCredential",
      "credentialCategory": "bachelor degree"
    },
    "experienceRequirements": {
      "@type": "OccupationalExperienceRequirements",
      "monthsOfExperience": 60
    },
    "job_link": "https://eg.linkedin.com/jobs/view/flavourist-sweet-egypt-at-givaudan-4223337779"
  }
]